espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG22/Include/efr32bg22_eusart.h
/* Bit fields for EUSART CMD */
#define _EUSART_CMD_RESETVALUE                      0x00000000UL                          /**< Default value for EUSART_CMD                */
#define _EUSART_CMD_MASK                            0x000001FFUL                          /**< Mask for EUSART_CMD                         */
#define EUSART_CMD_RXEN                             (0x1UL << 0)                          /**< Receiver Enable                             */
#define _EUSART_CMD_RXEN_SHIFT                      0                                     /**< Shift value for EUSART_RXEN                 */
#define _EUSART_CMD_RXEN_MASK                       0x1UL                                 /**< Bit mask for EUSART_RXEN                    */
#define _EUSART_CMD_RXEN_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_RXEN_DEFAULT                     (_EUSART_CMD_RXEN_DEFAULT << 0)       /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_RXDIS                            (0x1UL << 1)                          /**< Receiver Disable                            */
#define _EUSART_CMD_RXDIS_SHIFT                     1                                     /**< Shift value for EUSART_RXDIS                */
#define _EUSART_CMD_RXDIS_MASK                      0x2UL                                 /**< Bit mask for EUSART_RXDIS                   */
#define _EUSART_CMD_RXDIS_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_RXDIS_DEFAULT                    (_EUSART_CMD_RXDIS_DEFAULT << 1)      /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_TXEN                             (0x1UL << 2)                          /**< Transmitter Enable                          */
#define _EUSART_CMD_TXEN_SHIFT                      2                                     /**< Shift value for EUSART_TXEN                 */
#define _EUSART_CMD_TXEN_MASK                       0x4UL                                 /**< Bit mask for EUSART_TXEN                    */
#define _EUSART_CMD_TXEN_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_TXEN_DEFAULT                     (_EUSART_CMD_TXEN_DEFAULT << 2)       /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_TXDIS                            (0x1UL << 3)                          /**< Transmitter Disable                         */
#define _EUSART_CMD_TXDIS_SHIFT                     3                                     /**< Shift value for EUSART_TXDIS                */
#define _EUSART_CMD_TXDIS_MASK                      0x8UL                                 /**< Bit mask for EUSART_TXDIS                   */
#define _EUSART_CMD_TXDIS_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_TXDIS_DEFAULT                    (_EUSART_CMD_TXDIS_DEFAULT << 3)      /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_RXBLOCKEN                        (0x1UL << 4)                          /**< Receiver Block Enable                       */
#define _EUSART_CMD_RXBLOCKEN_SHIFT                 4                                     /**< Shift value for EUSART_RXBLOCKEN            */
#define _EUSART_CMD_RXBLOCKEN_MASK                  0x10UL                                /**< Bit mask for EUSART_RXBLOCKEN               */
#define _EUSART_CMD_RXBLOCKEN_DEFAULT               0x00000000UL                          /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_RXBLOCKEN_DEFAULT                (_EUSART_CMD_RXBLOCKEN_DEFAULT << 4)  /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_RXBLOCKDIS                       (0x1UL << 5)                          /**< Receiver Block Disable                      */
#define _EUSART_CMD_RXBLOCKDIS_SHIFT                5                                     /**< Shift value for EUSART_RXBLOCKDIS           */
#define _EUSART_CMD_RXBLOCKDIS_MASK                 0x20UL                                /**< Bit mask for EUSART_RXBLOCKDIS              */
#define _EUSART_CMD_RXBLOCKDIS_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_RXBLOCKDIS_DEFAULT               (_EUSART_CMD_RXBLOCKDIS_DEFAULT << 5) /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_TXTRIEN                          (0x1UL << 6)                          /**< Transmitter Tristate Enable                 */
#define _EUSART_CMD_TXTRIEN_SHIFT                   6                                     /**< Shift value for EUSART_TXTRIEN              */
#define _EUSART_CMD_TXTRIEN_MASK                    0x40UL                                /**< Bit mask for EUSART_TXTRIEN                 */
#define _EUSART_CMD_TXTRIEN_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_TXTRIEN_DEFAULT                  (_EUSART_CMD_TXTRIEN_DEFAULT << 6)    /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_TXTRIDIS                         (0x1UL << 7)                          /**< Transmitter Tristate Disable                */
#define _EUSART_CMD_TXTRIDIS_SHIFT                  7                                     /**< Shift value for EUSART_TXTRIDIS             */
#define _EUSART_CMD_TXTRIDIS_MASK                   0x80UL                                /**< Bit mask for EUSART_TXTRIDIS                */
#define _EUSART_CMD_TXTRIDIS_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_TXTRIDIS_DEFAULT                 (_EUSART_CMD_TXTRIDIS_DEFAULT << 7)   /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_CLEARTX                          (0x1UL << 8)                          /**< Clear TX FIFO                               */
#define _EUSART_CMD_CLEARTX_SHIFT                   8                                     /**< Shift value for EUSART_CLEARTX              */
#define _EUSART_CMD_CLEARTX_MASK                    0x100UL                               /**< Bit mask for EUSART_CLEARTX                 */
#define _EUSART_CMD_CLEARTX_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_CLEARTX_DEFAULT                  (_EUSART_CMD_CLEARTX_DEFAULT << 8)    /**< Shifted mode DEFAULT for EUSART_CMD         */

/* Bit fields for EUSART RXDATA */
#define _EUSART_RXDATA_RESETVALUE                   0x00000000UL                         /**< Default value for EUSART_RXDATA             */
#define _EUSART_RXDATA_MASK                         0x000007FFUL                         /**< Mask for EUSART_RXDATA                      */
#define _EUSART_RXDATA_RXDATA_SHIFT                 0                                    /**< Shift value for EUSART_RXDATA               */
#define _EUSART_RXDATA_RXDATA_MASK                  0x1FFUL                              /**< Bit mask for EUSART_RXDATA                  */
#define _EUSART_RXDATA_RXDATA_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for EUSART_RXDATA              */
#define EUSART_RXDATA_RXDATA_DEFAULT                (_EUSART_RXDATA_RXDATA_DEFAULT << 0) /**< Shifted mode DEFAULT for EUSART_RXDATA      */
#define EUSART_RXDATA_PERR                          (0x1UL << 9)                         /**< Parity Error                                */
#define _EUSART_RXDATA_PERR_SHIFT                   9                                    /**< Shift value for EUSART_PERR                 */
#define _EUSART_RXDATA_PERR_MASK                    0x200UL                              /**< Bit mask for EUSART_PERR                    */
#define _EUSART_RXDATA_PERR_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for EUSART_RXDATA              */
#define EUSART_RXDATA_PERR_DEFAULT                  (_EUSART_RXDATA_PERR_DEFAULT << 9)   /**< Shifted mode DEFAULT for EUSART_RXDATA      */
#define EUSART_RXDATA_FERR                          (0x1UL << 10)                        /**< Framing Error                               */
#define _EUSART_RXDATA_FERR_SHIFT                   10                                   /**< Shift value for EUSART_FERR                 */
#define _EUSART_RXDATA_FERR_MASK                    0x400UL                              /**< Bit mask for EUSART_FERR                    */
#define _EUSART_RXDATA_FERR_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for EUSART_RXDATA              */
#define EUSART_RXDATA_FERR_DEFAULT                  (_EUSART_RXDATA_FERR_DEFAULT << 10)  /**< Shifted mode DEFAULT for EUSART_RXDATA      */

/* Bit fields for EUSART RXDATAP */
#define _EUSART_RXDATAP_RESETVALUE                  0x00000000UL                           /**< Default value for EUSART_RXDATAP            */
#define _EUSART_RXDATAP_MASK                        0x000007FFUL                           /**< Mask for EUSART_RXDATAP                     */
#define _EUSART_RXDATAP_RXDATAP_SHIFT               0                                      /**< Shift value for EUSART_RXDATAP              */
#define _EUSART_RXDATAP_RXDATAP_MASK                0x1FFUL                                /**< Bit mask for EUSART_RXDATAP                 */
#define _EUSART_RXDATAP_RXDATAP_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for EUSART_RXDATAP             */
#define EUSART_RXDATAP_RXDATAP_DEFAULT              (_EUSART_RXDATAP_RXDATAP_DEFAULT << 0) /**< Shifted mode DEFAULT for EUSART_RXDATAP     */
#define EUSART_RXDATAP_PERRP                        (0x1UL << 9)                           /**< Parity Error Peek                           */
#define _EUSART_RXDATAP_PERRP_SHIFT                 9                                      /**< Shift value for EUSART_PERRP                */
#define _EUSART_RXDATAP_PERRP_MASK                  0x200UL                                /**< Bit mask for EUSART_PERRP                   */
#define _EUSART_RXDATAP_PERRP_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for EUSART_RXDATAP             */
#define EUSART_RXDATAP_PERRP_DEFAULT                (_EUSART_RXDATAP_PERRP_DEFAULT << 9)   /**< Shifted mode DEFAULT for EUSART_RXDATAP     */
#define EUSART_RXDATAP_FERRP                        (0x1UL << 10)                          /**< Framing Error Peek                          */
#define _EUSART_RXDATAP_FERRP_SHIFT                 10                                     /**< Shift value for EUSART_FERRP                */
#define _EUSART_RXDATAP_FERRP_MASK                  0x400UL                                /**< Bit mask for EUSART_FERRP                   */
#define _EUSART_RXDATAP_FERRP_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for EUSART_RXDATAP             */
#define EUSART_RXDATAP_FERRP_DEFAULT                (_EUSART_RXDATAP_FERRP_DEFAULT << 10)  /**< Shifted mode DEFAULT for EUSART_RXDATAP     */

/* Bit fields for EUSART TXDATA */
#define _EUSART_TXDATA_RESETVALUE                   0x00000000UL                           /**< Default value for EUSART_TXDATA             */
#define _EUSART_TXDATA_MASK                         0x00003FFFUL                           /**< Mask for EUSART_TXDATA                      */
#define _EUSART_TXDATA_TXDATA_SHIFT                 0                                      /**< Shift value for EUSART_TXDATA               */
#define _EUSART_TXDATA_TXDATA_MASK                  0x1FFUL                                /**< Bit mask for EUSART_TXDATA                  */
#define _EUSART_TXDATA_TXDATA_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for EUSART_TXDATA              */
#define EUSART_TXDATA_TXDATA_DEFAULT                (_EUSART_TXDATA_TXDATA_DEFAULT << 0)   /**< Shifted mode DEFAULT for EUSART_TXDATA      */
#define EUSART_TXDATA_UBRXAT                        (0x1UL << 9)                           /**< Unblock RX After Transmission               */
#define _EUSART_TXDATA_UBRXAT_SHIFT                 9                                      /**< Shift value for EUSART_UBRXAT               */
#define _EUSART_TXDATA_UBRXAT_MASK                  0x200UL                                /**< Bit mask for EUSART_UBRXAT                  */
#define _EUSART_TXDATA_UBRXAT_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for EUSART_TXDATA              */
#define EUSART_TXDATA_UBRXAT_DEFAULT                (_EUSART_TXDATA_UBRXAT_DEFAULT << 9)   /**< Shifted mode DEFAULT for EUSART_TXDATA      */
#define EUSART_TXDATA_TXTRIAT                       (0x1UL << 10)                          /**< Set TXTRI After Transmisssion               */
#define _EUSART_TXDATA_TXTRIAT_SHIFT                10                                     /**< Shift value for EUSART_TXTRIAT              */
#define _EUSART_TXDATA_TXTRIAT_MASK                 0x400UL                                /**< Bit mask for EUSART_TXTRIAT                 */
#define _EUSART_TXDATA_TXTRIAT_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for EUSART_TXDATA              */
#define EUSART_TXDATA_TXTRIAT_DEFAULT               (_EUSART_TXDATA_TXTRIAT_DEFAULT << 10) /**< Shifted mode DEFAULT for EUSART_TXDATA      */
#define EUSART_TXDATA_TXBREAK                       (0x1UL << 11)                          /**< Transit Data as Break                       */
#define _EUSART_TXDATA_TXBREAK_SHIFT                11                                     /**< Shift value for EUSART_TXBREAK              */
#define _EUSART_TXDATA_TXBREAK_MASK                 0x800UL                                /**< Bit mask for EUSART_TXBREAK                 */
#define _EUSART_TXDATA_TXBREAK_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for EUSART_TXDATA              */
#define EUSART_TXDATA_TXBREAK_DEFAULT               (_EUSART_TXDATA_TXBREAK_DEFAULT << 11) /**< Shifted mode DEFAULT for EUSART_TXDATA      */
#define EUSART_TXDATA_TXDISAT                       (0x1UL << 12)                          /**< Clear TXEN After Transmission               */
#define _EUSART_TXDATA_TXDISAT_SHIFT                12                                     /**< Shift value for EUSART_TXDISAT              */
#define _EUSART_TXDATA_TXDISAT_MASK                 0x1000UL                               /**< Bit mask for EUSART_TXDISAT                 */
#define _EUSART_TXDATA_TXDISAT_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for EUSART_TXDATA              */
#define EUSART_TXDATA_TXDISAT_DEFAULT               (_EUSART_TXDATA_TXDISAT_DEFAULT << 12) /**< Shifted mode DEFAULT for EUSART_TXDATA      */
#define EUSART_TXDATA_RXENAT                        (0x1UL << 13)                          /**< Enable RXEN After Transmission              */
#define _EUSART_TXDATA_RXENAT_SHIFT                 13                                     /**< Shift value for EUSART_RXENAT               */
#define _EUSART_TXDATA_RXENAT_MASK                  0x2000UL                               /**< Bit mask for EUSART_RXENAT                  */
#define _EUSART_TXDATA_RXENAT_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for EUSART_TXDATA              */
#define EUSART_TXDATA_RXENAT_DEFAULT                (_EUSART_TXDATA_RXENAT_DEFAULT << 13)  /**< Shifted mode DEFAULT for EUSART_TXDATA      */

